# ++ 1021 단어 1개 입력받아 그대로 출력하기

# a = input()

# print(a)


# ++ 1022 문장 1개 입력받아 그대로 출력하기

# a = input()

# print(a)


# ++ 1023 실수 1개 입력받아 부분별로 출력하기   (소수점을 기준으로 나워서 출력)

# a,b = input().split(".")

# print(a)
# print(b)


# ++ 1024 단어 1개 입력받아 나누어 출력하기   (단어 하나 하나를 나누어 출력)

# a = input()

# for i in a:
#    print("'" + i + "'")    #for 반복문을 이용하여 a의 입력값이 끝날 때 까지'(입력값)' print가 되게 한다.
# 단어 전체를 a로 놓고 i로 하나하나 나눠주는 부분


# ++ 1025 정수 1개 입력받아 나누어 출력하기

# a = input()

# print("[%d]" %(int(a[0])*10000))
# print("[%d]" %(int(a[1])*1000))
# print("[%d]" %(int(a[2])*100))
# print("[%d]" %(int(a[3])*10))
# print("[%d]" %(int(a[4])*1))

# 10000자리, 1000자리, 100자리, 10자리, 1자리로 나누어서 각각의 크기를 출력


# ++ 1026 시분초 입력받아 분만 출력하기

# a,b,c = input().split(":")   ":"를 기준으로 시간, 분, 초로 나누어서 출력

# print(b)


# ++ 1027 년월일 입력 받아 형식 바꾸어 출력하기

# year, month, date = input().split(".")   "."을 기준으로 년, 월, 일을 입력받아서 일, 월, 년 순서로 "-"로 나눠서 출력

# print("%02d" % int(date), end = "-")
# print("%02d" % int(month), end = "-")
# print("%04d" % int(year)) 


# ++ 1028 정수 1개 입력받아 그대로 출력하기

# a = input()

# print(a)


# ++ 1029 실수 1개 입력받아 그대로 출력하기 

# b = input()   소수점 11자리 이하로 출력

# print("%.11f" %float(b))


# ++ 1030 정수 1개 입력받아 그대로 출력하기

# a = input()

# print(a)
